---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.SetDown
source: html/ae3bff2f-151e-9924-cd83-0ef3f3411e54.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.SetDown Property

The abbreviation of the Set Down (SD) string.

## Syntax (C#)
```csharp
public string SetDown { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null